#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_acm_certificate.pub_acm_cert: Refreshing state... [id=arn:aws:acm:us-east-1:161444948461:certificate/ca905f14-6e5f-4969-92d9-9bcc56789321]
aws_iam_role.pub_lambda_covid: Refreshing state... [id=pub-lambda-covid-policy-20210328102712141600000001]
aws_s3_bucket_public_access_block.pub_s3_bucket_pub_policy: Refreshing state... [id=lastlocalcase.sg]
aws_iam_role.iam_for_lambda: Refreshing state... [id=pub_lastlocal_lambda_invalidation_role]
aws_iam_role.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001]
aws_kms_key.credentialbucketkey: Refreshing state... [id=6f7bae89-6f6b-42e9-8189-4654b315126f]
aws_cloudwatch_event_rule.every_one_hour: Refreshing state... [id=every-one-hour]
aws_cloudfront_origin_access_identity.pub_origin_access_identity: Refreshing state... [id=EFVXTJMSPUTAJ]
aws_iam_role.pub_last_lambda_inv_exec: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002]
aws_s3_bucket_object.pub_repo_html["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_object.pub_repo_html["index.dev.html"]: Refreshing state... [id=index.dev.html]
aws_s3_bucket.pub_s3_bucket: Refreshing state... [id=lastlocalcase.sg]
aws_s3_bucket.terraform_artifact_bucket: Refreshing state... [id=sg-lastlocalcase-artifact-bucket]
aws_lambda_function.pub_s3_invalidation: Refreshing state... [id=public_lastlocal_invalidation]
aws_iam_role_policy.pub_lambda_covid: Refreshing state... [id=pub-lambda-covid-policy-20210328102712141600000001:pub-lambda-covid-policy-20210328102712456400000002]
aws_iam_role_policy.pub_lambda_invalidation_execution: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002:public-invalidation-policy-20210327112911590900000003]
aws_lambda_function.pub_covid_scraper: Refreshing state... [id=covid_scraper]
aws_lambda_function.pub_folder_index_redirect: Refreshing state... [id=pub-last-index-redirect]
aws_iam_role_policy.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001:pub-last-lambda-policy-20210327112911683900000004]
aws_route53_record.pub_cert_validation: Refreshing state... [id=Z00563891EDJS4V1EERXS__3a7894d230589c3c6b3e2ca56b6488ce.lastlocalcase.sg._CNAME]
aws_cloudwatch_event_target.check_covid_every_one_hour: Refreshing state... [id=every-one-hour-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_check_covid: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_permission.allow_covid_bucket: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_permission.allow_bucket: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_cloudfront_distribution.pub_s3_distribution: Refreshing state... [id=E3INA79U1U2Q7W]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=lastlocalcase.sg]
aws_route53_record.pub_route53_record: Refreshing state... [id=Z00563891EDJS4V1EERXS_lastlocalcase.sg_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.pub_s3_invalidation will be updated in-place
  ~ resource "aws_lambda_function" "pub_s3_invalidation" {
        id                             = "public_lastlocal_invalidation"
      ~ last_modified                  = "2021-03-30T13:08:18.418+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:161444948461:function:public_lastlocal_invalidation:6" -> (known after apply)
      ~ source_code_hash               = "RHyt/+0d23eU6dHwiG1DRP3HWpmHNqVpdgmUyEcPJn8=" -> "zoujQU6wLV0jwrICfWPneJOTzOA1KOm1vFwKniA2Q0k="
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_object.pub_repo_html["download.png"] will be created
  + resource "aws_s3_bucket_object" "pub_repo_html" {
      + acl                    = "private"
      + bucket                 = "lastlocalcase.sg"
      + content_type           = "text/html; charset=UTF-8"
      + etag                   = "5ff8a047c28330dcd647e60c1da936a0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "download.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../files/html/download.png"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.pub_repo_html["index.dev.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "pub_repo_html" {
      ~ etag          = "27aa22976bbfb5f76f06cca349f439d2" -> "047967b899c394b624c78210964f7d83"
        id            = "index.dev.html"
        tags          = {}
      ~ version_id    = "4ZW5xRzxzyma..SY5SgA2iaJEf9ULLa0" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.pub_repo_html["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "pub_repo_html" {
      ~ etag          = "8305d0104bbe03d8815b2e7239835886" -> "047967b899c394b624c78210964f7d83"
        id            = "index.html"
        tags          = {}
      ~ version_id    = "f6YgUod4P08S9vlXeFq1Gc4Xb2ZxwJ4B" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfapply

To perform exactly these actions, run the following command to apply:
    terraform apply "tfapply"

```
</details>
*Pusher: @artagel, Action: `pull_request`*